{
    "basic_questions.txt": [
        "must do a dissertation/project work in their final semester. 15. Are professors available for research with students? Response: Yes, KSSEM encourages student participation in research. Some faculty members guide students in AI, IoT, Robotics, VLSI, and renewable energy projects. There are opportunities to publish papers and participate in hackathons, conferences, and project exhibitions. 16. Is it popular to study abroad? Response: Studying abroad is not very common, but some students pursue higher studies (MS, MBA) in the USA, Canada, and Germany after graduation. KSSEM provides guidance for GRE, TOEFL, and IELTS preparations through its career development programs. CAMPUS LIFE:- Life as a First-Year Student at KSSEM: 1. What's it like to be a first-year student here? Response: Being a first-year student at KSSEM is an exciting yet challenging experience. The college provides orientation programs to help new students adjust. Faculty members are approachable, and there is peer support to guide freshers. 2. What's a typical day like? Response: A typical day at KSSEM includes: ✔ Morning lectures (8:30 AM – 1:00 PM) – Theory classes & lab sessions. ✔ Lunch break (1:00 PM – 1:45 PM) – Students relax or socialize. ✔ Afternoon sessions (1:45 PM – 4:00 PM) – More classes, workshops, or project work. ✔ Evening activities – Club meetings, sports, or library study. 3. How much time do students spend studying per week? Response: On average, students spend 20-25 hours per week on academics, including: ✔ Classroom learning (30-35 hours/week). ✔ Assignments & project work (5-10 hours/week). ✔ Exam preparation (extra hours during exams). 4. What do you do when you're not in class? Response: Students engage in: ✔ Coding, project work, or group discussions. ✔ Club activities (robotics, music, cultural, etc.). ✔ Sports & fitness activities. ✔ Hanging out at the canteen or library. 5. What do you do on the weekends? Response: Weekends are for: ✔ Relaxing, catching up on studies, or preparing for tests. ✔ Internships or workshops. ✔ Sports, gaming, or club events. ✔ Exploring Bangalore’s malls, cafes, and parks. 6. What is the social scene like? Response: KSSEM has a friendly and inclusive environment. ✔ Festivals like Ethnic Day & Tech Fests keep students engaged. ✔ Peer interactions in clubs & organizations help networking. ✔ Group projects and teamwork build friendships. 7. What kinds of things are there to do in your school's hometown? Response: KSSEM is located in Bangalore, offering: ✔ Malls & cafes (Orion Mall, Mantri Square). ✔ Parks & nature spots (Lalbagh, Cubbon Park). ✔ Tech hubs (for networking & internships). ✔ Adventure activities (go-karting, trekking). Campus Life at KSSEM 8. How’s the food? Response: ✔ The college canteen serves affordable, hygienic, and tasty food. ✔ There are North & South Indian meal options. ✔ Popular nearby eateries offer variety. 9. Do most students live on-campus? Response: ✔ KSSEM has hostel facilities for outstation students. ✔ Most local students commute daily via college transport or personal vehicles. 10. How are the dorms? Response: ✔ Hostels are comfortable with WiFi, study rooms, and mess facilities. ✔ Separate boys' and girls' hostels are available. ✔ Hostel life is decent but strict in terms of rules. 11. Which clubs and student organizations are popular? Response: Popular clubs include: ✔ Technical Clubs – Coding, Robotics, AI, IoT. ✔ Cultural Clubs – Music, Dance, Drama. ✔ Sports Clubs – Cricket, Basketball, Badminton. ✔ Entrepreneurship & Innovation Cell. 12. Do lots of students belong to fraternities or sororities? Response: No, fraternities and sororities are not common in KSSEM. However, students actively participate in clubs and societies. 13. What's your favorite place on campus? Response: ✔ Library – Peaceful study environment. ✔ Canteen – Best place to relax & socialize. ✔ Tech Labs – Hands-on learning for students. 14. Where do you like to study? Response: ✔ Library study rooms for quiet learning. ✔ Project labs for group work. ✔ Hostel rooms for personal study. Campus Facilities & Accessibility 15. What are the facilities like (science labs, libraries, theatres, gyms, etc.)? Response: ✔ Modern science & computer labs for practical learning. ✔ Spacious library with digital resources. ✔ Sports facilities including basketball, badminton courts. ✔ Seminar halls & auditoriums for events. 16. Are there enough computer labs? Response: ✔ Yes, KSSEM has multiple computer labs with high-speed internet & advanced software for technical courses. 17. How is the WiFi on campus? Response: ✔ WiFi is available across the campus, but speed varies in some areas. ✔ Students also get WiFi access in hostels & labs. 18. Is it easy to get around campus? Response: ✔ KSSEM campus is compact and walkable. ✔ Shuttle services & transport facilities are available. 19. Are sports popular? Response: ✔ Yes! Cricket, basketball, volleyball, and badminton are popular. ✔ The college hosts sports competitions and encourages participation. 20. Is there a lot of school spirit? Response: ✔ KSSEM students actively participate in events, tech fests, and cultural programs. ✔ Annual fests & inter-college competitions boost enthusiasm. STUDENT BODY AT KSSEM:- 1. How would you describe your fellow students? Response: ✔ KSSEM students are hardworking, enthusiastic, and career-driven. ✔ Most students are focused on academics and technical skills. ✔ There is a good mix of students interested in extracurricular activities like sports, music, and coding clubs. 2. Are the students here friendly? Response: ✔ Yes! KSSEM has a welcoming and friendly environment. ✔ Seniors and juniors interact well, especially through clubs and cultural events. ✔ Faculty members are also approachable, creating a comfortable learning space. 3. What makes the student body unique? Response: ✔ KSSEM students are highly technical with a passion for innovation and engineering. ✔ Many students participate in hackathons, technical fests, and startup incubators. ✔ There is a strong emphasis on collaborative learning and teamwork. 4. Is there diversity on campus? Response: ✔ Yes, KSSEM has a diverse student population with students from different backgrounds across Karnataka and India. ✔ The mix of students from urban and rural areas provides a unique perspective on learning. 5. Are there many",
        "BASIC QUESTION:- Here are the answers based on K.S. School of Engineering and Management (KSSEM), Bangalore: 1. Why did you choose this school? Response: Many students choose KSSEM for its reputation in engineering and management, strong industry connections, modern infrastructure, and excellent faculty. The college provides quality education under VTU (Visvesvaraya Technological University) and has a dedicated placement cell that helps students secure jobs in top companies. The campus facilities, well-equipped labs, and extracurricular activities also make it an attractive choice. 2. Are you happy here? Response: Overall, students at KSSEM enjoy their academic and campus life. The supportive faculty, hands-on learning approach, internships, cultural fests, and technical clubs contribute to a positive learning experience. Many students appreciate the placement training and career guidance provided by the college. However, some students feel that certain aspects, like placement opportunities for non-tech branches, could be improved. 3. What are your school's strengths? Response: KSSEM has several strengths, including: ✔ Strong Academics: Well-qualified faculty, structured curriculum, and research opportunities. ✔ Industry Connections: Frequent workshops, guest lectures, and internship tie-ups with top companies. ✔ Modern Infrastructure: Well-equipped labs, library, auditoriums, and sports facilities. ✔ Placement Support: A dedicated placement cell that helps students get placed in companies like Infosys, TCS, Wipro, Capgemini, Amazon, and Bosch. ✔ Vibrant Campus Life: Clubs, hackathons, fests, and cultural events for holistic development. 4. What’s your #1 complaint about your school? Response: One of the common complaints from students is that some departments, especially non-CS branches, have fewer core company placement opportunities. While the Computer Science, AI/ML, and IT-related branches get a good number of placements, branches like Mechanical and Civil Engineering could have better placement assistance in core fields. 5. What else could stand to be improved? Response: KSSEM is constantly improving, but some areas that could be enhanced include: 🔹 More core placements: Better industry partnerships for Mechanical, Civil, and Electrical students. 🔹 Wi-Fi connectivity: Some students feel that Wi-Fi access could be more reliable across campus. 🔹 Increased research opportunities: More funded projects and collaborations with research organizations. 🔹 More international exposure: Tie-ups with foreign universities for student exchange programs. 6. How accessible are administrators, registrars, financial aid officers, etc.? Response: KSSEM has a student-friendly administration. The faculty, department heads, and placement officers are approachable. The registrar’s office, financial aid office, and student support centers are available during college hours, and students can easily get help regarding fees, scholarships, and academic queries. However, during peak admission times, students might experience delays in responses due to high demand. Academics at KSSEM:- 1. What majors are popular? Response: At KSSEM, the most popular majors (undergraduate programs) include: ✔ Computer Science & Engineering (CSE) ✔ Artificial Intelligence & Machine Learning (AI/ML) ✔ Electronics & Communication Engineering (ECE) ✔ Information Science & Engineering (ISE) ✔ Mechanical Engineering ✔ Civil Engineering ✔ Electrical & Electronics Engineering (EEE) For postgraduate programs, the MBA (Master of Business Administration) is highly sought after. 2. What departments or programs have the best reputations? Response: KSSEM is well known for its Computer Science (CSE), AI/ML, and Electronics & Communication (ECE) departments. These branches have strong placement records and collaborations with industry leaders. The MBA program is also recognized for its practical approach and industry interaction. 3. What’s your favorite class? Response: Many students enjoy classes in: 🔹 Data Structures & Algorithms (CSE, ISE, AI/ML) – Helps in competitive programming and placements. 🔹 Machine Learning (AI/ML, CSE) – Covers trending technologies with real-world applications. 🔹 Microprocessors & Embedded Systems (ECE, EEE) – Practical applications in automation. 🔹 Project Management (MBA) – Real case studies and industry-focused training. 4. Are your professors good teachers? Response: Yes, most professors at KSSEM are highly qualified, experienced, and supportive. Many hold Ph.Ds. and have industry exposure, which helps students understand real-world applications. 5. Do your professors hold office hours, and will they meet with you outside of class? Response: Yes, KSSEM professors hold regular office hours where students can clarify doubts. They are also available through emails or appointment-based meetings. 6. Are most of your classes taught by professors or teaching assistants? Response: Most classes at KSSEM are taught by professors and senior faculty members. Teaching assistants (TAs) help in lab sessions and doubt-clearing sessions. 7. Were you able to take most of your first-choice classes? Response: Yes, students generally get their first-choice classes, especially in core subjects. However, for elective courses, availability may depend on demand. 8. Are your classes lecture-based or discussion-based? Response: KSSEM follows a mix of both: ✔ Core subjects – Mostly lecture-based with presentations. ✔ Technical subjects – Include hands-on lab sessions. ✔ MBA courses – More discussion-based with case studies and real-world examples. 9. How much reading and writing is required in your courses? Response: ✔ Engineering courses – Require moderate reading of textbooks and technical writing (assignments, lab reports, project documentation). ✔ MBA courses – Require more reading (case studies, research papers) and frequent report writing. 10. How often are collaborative work or group presentations required? Response: ✔ Engineering: Group projects are common in final-year projects and lab sessions. ✔ MBA: Group discussions, case study presentations, and teamwork assignments are frequent. 11. How satisfied are you with academic advising? Response: Students find academic advising helpful, but some feel it could be more structured for career guidance. Faculty members provide good mentoring for projects and placements. 12. Do students use any on-campus tutoring programs or writing centers? Response: Yes, KSSEM offers: ✔ Technical training workshops (coding, AI, ML, IoT, etc.). ✔ Placement training (aptitude, soft skills, resume building). ✔ Library resources and online learning platforms. However, there isn’t a dedicated writing center, but faculty members help students with academic writing. 13. How big are your classes? Response: ✔ Engineering: Typically 60–70 students per class. ✔ MBA: Around 30–50 students per batch, allowing for personalized interaction. 14. Does your major require an independent study or capstone project? Response: Yes, KSSEM follows VTU guidelines, where: ✔ Final-year engineering students must complete a major project. ✔ MBA students",
        "students from other countries? Response: ✔ KSSEM primarily has local and national students, with a few international students. ✔ The college encourages global exposure through exchange programs and collaborations. 6. Do students of different races and classes interact easily? Response: ✔ Yes! Students from various backgrounds interact freely through clubs, projects, and events. ✔ There is a strong sense of unity during cultural fests and technical symposiums. 7. Are students cliquish? Response: ✔ No, KSSEM students are inclusive and welcoming. ✔ Students form groups based on shared interests (coding, sports, music, etc.), but there's no exclusivity. ✔ Networking and teamwork are encouraged in projects and assignments. CAREER SERVICES AT KSSEM:- 1. Are internships available? How do you find them? ✔ Yes, KSSEM provides internship opportunities for students through its Training & Placement Cell. ✔ Students can find internships via: On-campus recruitment drives. Industry partnerships & MoUs with tech companies. Faculty recommendations and department-led initiatives. Online portals like Internshala, LinkedIn, and company websites. ✔ Internships are common in IT, core engineering, and management domains. 2. Is Career Services helpful? ✔ KSSEM’s Placement & Training Cell actively supports students in: Resume-building & interview preparation. Aptitude & technical training sessions. Mock interviews and group discussions. Pre-placement talks & company-specific coaching. ✔ The department also conducts coding bootcamps & hackathons to enhance employability. 3. Do you have a mentor? ✔ Yes, KSSEM follows a mentorship system where: Each student is assigned a faculty mentor for academic & career guidance. Seniors provide technical mentorship through coding clubs & project collaborations. Professors assist in research work & industry projects. 4. Does your school have a co-op program? ✔ While KSSEM does not have a formal co-op program, students gain hands-on experience through: Internships with industry partners. Live projects sponsored by companies. Industry-driven hackathons & case study competitions. ✔ The college also encourages startup initiatives & entrepreneurship programs. 5. Are there opportunities to build leadership skills on campus? ✔ Yes! KSSEM promotes leadership development through: Student-led technical clubs (IEEE, Robotics, Coding Club, AI-ML Club, Entrepreneurship Cell, etc.). Event organization for fests & technical symposiums. Peer mentoring & placement coordination roles. ✔ Students can also participate in NSS activities, volunteering, and workshops. 6. What options exist for service learning in the community? ✔ KSSEM encourages students to participate in community service initiatives, including: NSS (National Service Scheme) for social work & environmental awareness. Technical training sessions for underprivileged students. Tree plantation drives, blood donation camps, and rural development programs. 7. Do employers recruit students on campus? ✔ Yes! KSSEM has a dedicated Placement Cell that brings in top recruiters. ✔ Companies like Amazon, Infosys, Wipro, TCS, Accenture, Capgemini, Cognizant, and Bosch hire students from KSSEM. ✔ 70-80% of eligible students secure placements through on-campus recruitment. 8. How easy is it to find summer jobs and other kinds of work through your school? ✔ Finding summer jobs through KSSEM is moderately easy, as: The placement cell helps students connect with part-time internship opportunities. Students can apply for freelance work & internships through LinkedIn, Internshala, and referral programs. ✔ Teaching assistant roles & research internships are available within the college. 9. Who are some of the notable graduates from your college? ✔ KSSEM alumni have gone on to work in top MNCs and pursue higher studies in reputed universities. ✔ Some graduates have launched their own startups in tech & management fields. ✔ The alumni network is growing, contributing to industry collaborations & mentorship. 10. How visible is your school's alumni association on campus? ✔ KSSEM has an active alumni association, which: Conducts guest lectures & mentorship programs. Organizes annual alumni meets for networking & career guidance. Helps students with job referrals & industry connections. 11. What kinds of hands-on or practical experiences have you had in and outside of the classroom? ✔ KSSEM ensures practical learning through: Industry-oriented projects & hackathons. Internships & live industry projects. Research opportunities in emerging fields like AI-ML, IoT, and Blockchain. Workshops on robotics, coding, and cloud computing."
    ],
    "courses.txt": [
        "must do a dissertation/project work in their final semester. 15. Are professors available for research with students? Response: Yes, KSSEM encourages student participation in research. Some faculty members guide students in AI, IoT, Robotics, VLSI, and renewable energy projects. There are opportunities to publish papers and participate in hackathons, conferences, and project exhibitions. 16. Is it popular to study abroad? Response: Studying abroad is not very common, but some students pursue higher studies (MS, MBA) in the USA, Canada, and Germany after graduation. KSSEM provides guidance for GRE, TOEFL, and IELTS preparations through its career development programs. CAMPUS LIFE:- Life as a First-Year Student at KSSEM: 1. What's it like to be a first-year student here? Response: Being a first-year student at KSSEM is an exciting yet challenging experience. The college provides orientation programs to help new students adjust. Faculty members are approachable, and there is peer support to guide freshers. 2. What's a typical day like? Response: A typical day at KSSEM includes: ✔ Morning lectures (8:30 AM – 1:00 PM) – Theory classes & lab sessions. ✔ Lunch break (1:00 PM – 1:45 PM) – Students relax or socialize. ✔ Afternoon sessions (1:45 PM – 4:00 PM) – More classes, workshops, or project work. ✔ Evening activities – Club meetings, sports, or library study. 3. How much time do students spend studying per week? Response: On average, students spend 20-25 hours per week on academics, including: ✔ Classroom learning (30-35 hours/week). ✔ Assignments & project work (5-10 hours/week). ✔ Exam preparation (extra hours during exams). 4. What do you do when you're not in class? Response: Students engage in: ✔ Coding, project work, or group discussions. ✔ Club activities (robotics, music, cultural, etc.). ✔ Sports & fitness activities. ✔ Hanging out at the canteen or library. 5. What do you do on the weekends? Response: Weekends are for: ✔ Relaxing, catching up on studies, or preparing for tests. ✔ Internships or workshops. ✔ Sports, gaming, or club events. ✔ Exploring Bangalore’s malls, cafes, and parks. 6. What is the social scene like? Response: KSSEM has a friendly and inclusive environment. ✔ Festivals like Ethnic Day & Tech Fests keep students engaged. ✔ Peer interactions in clubs & organizations help networking. ✔ Group projects and teamwork build friendships. 7. What kinds of things are there to do in your school's hometown? Response: KSSEM is located in Bangalore, offering: ✔ Malls & cafes (Orion Mall, Mantri Square). ✔ Parks & nature spots (Lalbagh, Cubbon Park). ✔ Tech hubs (for networking & internships). ✔ Adventure activities (go-karting, trekking). Campus Life at KSSEM 8. How’s the food? Response: ✔ The college canteen serves affordable, hygienic, and tasty food. ✔ There are North & South Indian meal options. ✔ Popular nearby eateries offer variety. 9. Do most students live on-campus? Response: ✔ KSSEM has hostel facilities for outstation students. ✔ Most local students commute daily via college transport or personal vehicles. 10. How are the dorms? Response: ✔ Hostels are comfortable with WiFi, study rooms, and mess facilities. ✔ Separate boys' and girls' hostels are available. ✔ Hostel life is decent but strict in terms of rules. 11. Which clubs and student organizations are popular? Response: Popular clubs include: ✔ Technical Clubs – Coding, Robotics, AI, IoT. ✔ Cultural Clubs – Music, Dance, Drama. ✔ Sports Clubs – Cricket, Basketball, Badminton. ✔ Entrepreneurship & Innovation Cell. 12. Do lots of students belong to fraternities or sororities? Response: No, fraternities and sororities are not common in KSSEM. However, students actively participate in clubs and societies. 13. What's your favorite place on campus? Response: ✔ Library – Peaceful study environment. ✔ Canteen – Best place to relax & socialize. ✔ Tech Labs – Hands-on learning for students. 14. Where do you like to study? Response: ✔ Library study rooms for quiet learning. ✔ Project labs for group work. ✔ Hostel rooms for personal study. Campus Facilities & Accessibility 15. What are the facilities like (science labs, libraries, theatres, gyms, etc.)? Response: ✔ Modern science & computer labs for practical learning. ✔ Spacious library with digital resources. ✔ Sports facilities including basketball, badminton courts. ✔ Seminar halls & auditoriums for events. 16. Are there enough computer labs? Response: ✔ Yes, KSSEM has multiple computer labs with high-speed internet & advanced software for technical courses. 17. How is the WiFi on campus? Response: ✔ WiFi is available across the campus, but speed varies in some areas. ✔ Students also get WiFi access in hostels & labs. 18. Is it easy to get around campus? Response: ✔ KSSEM campus is compact and walkable. ✔ Shuttle services & transport facilities are available. 19. Are sports popular? Response: ✔ Yes! Cricket, basketball, volleyball, and badminton are popular. ✔ The college hosts sports competitions and encourages participation. 20. Is there a lot of school spirit? Response: ✔ KSSEM students actively participate in events, tech fests, and cultural programs. ✔ Annual fests & inter-college competitions boost enthusiasm. STUDENT BODY AT KSSEM:- 1. How would you describe your fellow students? Response: ✔ KSSEM students are hardworking, enthusiastic, and career-driven. ✔ Most students are focused on academics and technical skills. ✔ There is a good mix of students interested in extracurricular activities like sports, music, and coding clubs. 2. Are the students here friendly? Response: ✔ Yes! KSSEM has a welcoming and friendly environment. ✔ Seniors and juniors interact well, especially through clubs and cultural events. ✔ Faculty members are also approachable, creating a comfortable learning space. 3. What makes the student body unique? Response: ✔ KSSEM students are highly technical with a passion for innovation and engineering. ✔ Many students participate in hackathons, technical fests, and startup incubators. ✔ There is a strong emphasis on collaborative learning and teamwork. 4. Is there diversity on campus? Response: ✔ Yes, KSSEM has a diverse student population with students from different backgrounds across Karnataka and India. ✔ The mix of students from urban and rural areas provides a unique perspective on learning. 5. Are there many",
        "BASIC QUESTION:- Here are the answers based on K.S. School of Engineering and Management (KSSEM), Bangalore: 1. Why did you choose this school? Response: Many students choose KSSEM for its reputation in engineering and management, strong industry connections, modern infrastructure, and excellent faculty. The college provides quality education under VTU (Visvesvaraya Technological University) and has a dedicated placement cell that helps students secure jobs in top companies. The campus facilities, well-equipped labs, and extracurricular activities also make it an attractive choice. 2. Are you happy here? Response: Overall, students at KSSEM enjoy their academic and campus life. The supportive faculty, hands-on learning approach, internships, cultural fests, and technical clubs contribute to a positive learning experience. Many students appreciate the placement training and career guidance provided by the college. However, some students feel that certain aspects, like placement opportunities for non-tech branches, could be improved. 3. What are your school's strengths? Response: KSSEM has several strengths, including: ✔ Strong Academics: Well-qualified faculty, structured curriculum, and research opportunities. ✔ Industry Connections: Frequent workshops, guest lectures, and internship tie-ups with top companies. ✔ Modern Infrastructure: Well-equipped labs, library, auditoriums, and sports facilities. ✔ Placement Support: A dedicated placement cell that helps students get placed in companies like Infosys, TCS, Wipro, Capgemini, Amazon, and Bosch. ✔ Vibrant Campus Life: Clubs, hackathons, fests, and cultural events for holistic development. 4. What’s your #1 complaint about your school? Response: One of the common complaints from students is that some departments, especially non-CS branches, have fewer core company placement opportunities. While the Computer Science, AI/ML, and IT-related branches get a good number of placements, branches like Mechanical and Civil Engineering could have better placement assistance in core fields. 5. What else could stand to be improved? Response: KSSEM is constantly improving, but some areas that could be enhanced include: 🔹 More core placements: Better industry partnerships for Mechanical, Civil, and Electrical students. 🔹 Wi-Fi connectivity: Some students feel that Wi-Fi access could be more reliable across campus. 🔹 Increased research opportunities: More funded projects and collaborations with research organizations. 🔹 More international exposure: Tie-ups with foreign universities for student exchange programs. 6. How accessible are administrators, registrars, financial aid officers, etc.? Response: KSSEM has a student-friendly administration. The faculty, department heads, and placement officers are approachable. The registrar’s office, financial aid office, and student support centers are available during college hours, and students can easily get help regarding fees, scholarships, and academic queries. However, during peak admission times, students might experience delays in responses due to high demand. Academics at KSSEM:- 1. What majors are popular? Response: At KSSEM, the most popular majors (undergraduate programs) include: ✔ Computer Science & Engineering (CSE) ✔ Artificial Intelligence & Machine Learning (AI/ML) ✔ Electronics & Communication Engineering (ECE) ✔ Information Science & Engineering (ISE) ✔ Mechanical Engineering ✔ Civil Engineering ✔ Electrical & Electronics Engineering (EEE) For postgraduate programs, the MBA (Master of Business Administration) is highly sought after. 2. What departments or programs have the best reputations? Response: KSSEM is well known for its Computer Science (CSE), AI/ML, and Electronics & Communication (ECE) departments. These branches have strong placement records and collaborations with industry leaders. The MBA program is also recognized for its practical approach and industry interaction. 3. What’s your favorite class? Response: Many students enjoy classes in: 🔹 Data Structures & Algorithms (CSE, ISE, AI/ML) – Helps in competitive programming and placements. 🔹 Machine Learning (AI/ML, CSE) – Covers trending technologies with real-world applications. 🔹 Microprocessors & Embedded Systems (ECE, EEE) – Practical applications in automation. 🔹 Project Management (MBA) – Real case studies and industry-focused training. 4. Are your professors good teachers? Response: Yes, most professors at KSSEM are highly qualified, experienced, and supportive. Many hold Ph.Ds. and have industry exposure, which helps students understand real-world applications. 5. Do your professors hold office hours, and will they meet with you outside of class? Response: Yes, KSSEM professors hold regular office hours where students can clarify doubts. They are also available through emails or appointment-based meetings. 6. Are most of your classes taught by professors or teaching assistants? Response: Most classes at KSSEM are taught by professors and senior faculty members. Teaching assistants (TAs) help in lab sessions and doubt-clearing sessions. 7. Were you able to take most of your first-choice classes? Response: Yes, students generally get their first-choice classes, especially in core subjects. However, for elective courses, availability may depend on demand. 8. Are your classes lecture-based or discussion-based? Response: KSSEM follows a mix of both: ✔ Core subjects – Mostly lecture-based with presentations. ✔ Technical subjects – Include hands-on lab sessions. ✔ MBA courses – More discussion-based with case studies and real-world examples. 9. How much reading and writing is required in your courses? Response: ✔ Engineering courses – Require moderate reading of textbooks and technical writing (assignments, lab reports, project documentation). ✔ MBA courses – Require more reading (case studies, research papers) and frequent report writing. 10. How often are collaborative work or group presentations required? Response: ✔ Engineering: Group projects are common in final-year projects and lab sessions. ✔ MBA: Group discussions, case study presentations, and teamwork assignments are frequent. 11. How satisfied are you with academic advising? Response: Students find academic advising helpful, but some feel it could be more structured for career guidance. Faculty members provide good mentoring for projects and placements. 12. Do students use any on-campus tutoring programs or writing centers? Response: Yes, KSSEM offers: ✔ Technical training workshops (coding, AI, ML, IoT, etc.). ✔ Placement training (aptitude, soft skills, resume building). ✔ Library resources and online learning platforms. However, there isn’t a dedicated writing center, but faculty members help students with academic writing. 13. How big are your classes? Response: ✔ Engineering: Typically 60–70 students per class. ✔ MBA: Around 30–50 students per batch, allowing for personalized interaction. 14. Does your major require an independent study or capstone project? Response: Yes, KSSEM follows VTU guidelines, where: ✔ Final-year engineering students must complete a major project. ✔ MBA students",
        "students from other countries? Response: ✔ KSSEM primarily has local and national students, with a few international students. ✔ The college encourages global exposure through exchange programs and collaborations. 6. Do students of different races and classes interact easily? Response: ✔ Yes! Students from various backgrounds interact freely through clubs, projects, and events. ✔ There is a strong sense of unity during cultural fests and technical symposiums. 7. Are students cliquish? Response: ✔ No, KSSEM students are inclusive and welcoming. ✔ Students form groups based on shared interests (coding, sports, music, etc.), but there's no exclusivity. ✔ Networking and teamwork are encouraged in projects and assignments. CAREER SERVICES AT KSSEM:- 1. Are internships available? How do you find them? ✔ Yes, KSSEM provides internship opportunities for students through its Training & Placement Cell. ✔ Students can find internships via: On-campus recruitment drives. Industry partnerships & MoUs with tech companies. Faculty recommendations and department-led initiatives. Online portals like Internshala, LinkedIn, and company websites. ✔ Internships are common in IT, core engineering, and management domains. 2. Is Career Services helpful? ✔ KSSEM’s Placement & Training Cell actively supports students in: Resume-building & interview preparation. Aptitude & technical training sessions. Mock interviews and group discussions. Pre-placement talks & company-specific coaching. ✔ The department also conducts coding bootcamps & hackathons to enhance employability. 3. Do you have a mentor? ✔ Yes, KSSEM follows a mentorship system where: Each student is assigned a faculty mentor for academic & career guidance. Seniors provide technical mentorship through coding clubs & project collaborations. Professors assist in research work & industry projects. 4. Does your school have a co-op program? ✔ While KSSEM does not have a formal co-op program, students gain hands-on experience through: Internships with industry partners. Live projects sponsored by companies. Industry-driven hackathons & case study competitions. ✔ The college also encourages startup initiatives & entrepreneurship programs. 5. Are there opportunities to build leadership skills on campus? ✔ Yes! KSSEM promotes leadership development through: Student-led technical clubs (IEEE, Robotics, Coding Club, AI-ML Club, Entrepreneurship Cell, etc.). Event organization for fests & technical symposiums. Peer mentoring & placement coordination roles. ✔ Students can also participate in NSS activities, volunteering, and workshops. 6. What options exist for service learning in the community? ✔ KSSEM encourages students to participate in community service initiatives, including: NSS (National Service Scheme) for social work & environmental awareness. Technical training sessions for underprivileged students. Tree plantation drives, blood donation camps, and rural development programs. 7. Do employers recruit students on campus? ✔ Yes! KSSEM has a dedicated Placement Cell that brings in top recruiters. ✔ Companies like Amazon, Infosys, Wipro, TCS, Accenture, Capgemini, Cognizant, and Bosch hire students from KSSEM. ✔ 70-80% of eligible students secure placements through on-campus recruitment. 8. How easy is it to find summer jobs and other kinds of work through your school? ✔ Finding summer jobs through KSSEM is moderately easy, as: The placement cell helps students connect with part-time internship opportunities. Students can apply for freelance work & internships through LinkedIn, Internshala, and referral programs. ✔ Teaching assistant roles & research internships are available within the college. 9. Who are some of the notable graduates from your college? ✔ KSSEM alumni have gone on to work in top MNCs and pursue higher studies in reputed universities. ✔ Some graduates have launched their own startups in tech & management fields. ✔ The alumni network is growing, contributing to industry collaborations & mentorship. 10. How visible is your school's alumni association on campus? ✔ KSSEM has an active alumni association, which: Conducts guest lectures & mentorship programs. Organizes annual alumni meets for networking & career guidance. Helps students with job referrals & industry connections. 11. What kinds of hands-on or practical experiences have you had in and outside of the classroom? ✔ KSSEM ensures practical learning through: Industry-oriented projects & hackathons. Internships & live industry projects. Research opportunities in emerging fields like AI-ML, IoT, and Blockchain. Workshops on robotics, coding, and cloud computing."
    ],
    "faculty.txt": [
        "KSSEM TEACHERS LIST:- PHYSICS: ​At K.S. School of Engineering and Management (KSSEM) in Mallasandra, the Department of Physics is staffed by a team of dedicated and experienced faculty members. Here is a list of the current physics faculty:​ 1.Dr. Vaishali R. Bote: Assistant Professor with 12 years of teaching experience. Her areas of interest include Material Science and Nanocomposites. She holds an M.Sc. and Ph.D. in Physics. ​ 2.Dr. Sumantha H. S.: Assistant Professor with 4 years of teaching and research experience. His research interests are in Materials Science and Energy Storage Devices. He has an M.Sc. in Physics and a Ph.D. ​ 3.Ms. Pavithra J.: Assistant Professor with 15 years of teaching experience. Her areas of interest are Nuclear and Particle Physics, and Fluid Dynamics. She holds an M.Sc. in Physics and has qualified K-SET. 4.Ms. Nisha P. G.: Assistant Professor with 5 years of teaching and 10 years of research experience. Her interests include Atmospheric and Ocean Sciences, and Climate Change. She holds an M.Tech and is pursuing a Ph.D. ​ 5.Mr. Keerthi A.: Assistant Professor with a background in Physics. He has presented research on \"The Physical Aspects in Carnatic Music\" at a high-energy physics conference. ​ CHEMISTRY: At K.S. School of Engineering and Management (KSSEM) in Mallasandra, the Chemistry faculty includes:​ 1.Dr. Anitha R: Assistant Professor with 18 years of teaching experience. Her areas of interest are Nanoscience and Biochemistry. She handles subjects like Engineering Chemistry theory and lab, and Environmental Studies. ​ 2.Dr. Swarna S: Assistant Professor with 15 years of teaching experience. Her areas of interest include Organic Chemistry, Biodiesel, and Nanomaterials. She is involved in teaching and research in these fields. 3.Dr. Radha H. R: Assistant Professor with 24 years of teaching experience. Her interests encompass Electrochemistry, Drug Synthesis, Biodiesel, Nanomaterials, and Environmental Chemistry. She has numerous publications in these areas. ​ 4.Ms. Pallavi B. N: Assistant Professor with a Master's degree in Organic Chemistry. Her area of interest is Nanochemistry. She is a recent addition to the faculty, bringing fresh perspectives to the department. ​ 5.Mr. Avinash R: Chemistry Lab Instructor with 5 years of teaching experience. He assists in conducting laboratory sessions and experiments. METHEMATICS: 1.Dr. C. Vasudev: Assistant Professor in Mathematics. ​ 2.Dr. Radha: Assistant Professor in Mathematics. ​ 3.Mrs. Vinutha S.V.: Assistant Professor in Mathematics. ​ 4.Mr. Manoharkumar K.N.: Assistant Professor in Mathematics. ​ 5.Mrs. Nagarathna T.K.: Assistant Professor in Mathematics. ​ 6.Ms. Divya R.: Assistant Professor in Mathematics. ​ 7.Ms. Kusuma M.: Assistant Professor in Mathematics. ​ 8.Ms. Anitha: Assistant Professor in Mathematics."
    ],
    "founder.txt": [
        "Here’s the information for each institution under the K.S. Group of Institutions: 1. K.S. School of Engineering and Management (KSSEM) Established: 2010 (renamed in 2011) Founder: Kammavari Sangham Website: https://www.kssem.edu.in/ 2. K.S. Polytechnic (KSP) Established: 1992 Founder: Kammavari Sangham Website: https://www.kspolytechnic.edu.in/ 3. K.S. School of Architecture (KSSA) Established: 2015 Founder: Kammavari Sangham Website: https://www.kssa.edu.in/ About Kammavari Sangham Founded: 1952 Founder: C.G. Chinnappa Naidu, a civil contractor from Bangalore Purpose: A non-profit organization aimed at providing education and social welfare"
    ],
    "ksp.txt": [
        "DTE - Code : 465 Notification | Kammavari Sangham (R) 1952, K. S. Group of Institutions K. S. POLYTECHNIC No.15, Mallasandra, Off. Kanakapura Road, Bengaluru-560109, +919606064189 Approved by AICTE, New-Delhi and Recognized by DTE, Govt. of Karnataka WELCOME TO K. S. POLYTECHNIC ---------------------------- By the blessings of the elders of Kammavari Sangham, K S Polytechnic was started in the year 1992 with the sole intension of providing quality education to poor, down trodden, under privileged, students of kamma community in particular and society in general. It started with just two branches viz computer science & engineering and electronics and communication engineering with an intake of 30 students in each branch at #5 chennammana kere achukattu, Bengaluru. Later in the year 1994 two more branches i.e., mechanical engineering and automobile engineering were added and the intake was increased to 60 students in each branch. To provide more amenities It was shifted to #14 Raguvanahalli, kanakapura road, Bengaluru In the year 1995. In the year 2000 the civil engineering branch was added with an intake of 60 students. Furthermore with a vision of providing hi-tech facilities as per the current technical trends and growing needs of the students K S Polytechnic was shifted to KSGI Campus - 2 at #15, Mallasandra, Off Kanakapura road Bengaluru which is spread across 7 acres with greenery around the campus. A fairly large percentage of students have claimed that KSP is known for its professionalism as well as its strong affliction towards making the students prepare for the outside world that is both challenging and intimidating. Our reputation precedes our words and we have more than 800 students studying across the 5 different courses. There has been a great demand for admission to K.S. Polytechnic since its inception as we stand one among the top polytechnics in Bengaluru. So far around 5500 students have been graduated from this institution since Inception out of which approximately 2500 students have pursued higher education successfully, about 1000 students have become entrepreneur's and the rest have joined reputed companies. During the year 2016 our college has been awarded \" Most promising private polytechnic in Bangalore \" by the global excellence awards prime time media private limited New Delhi. SCHOOLVISION ------------ WORKSPACE_PREMIUMMISSION ------------------------ THE LATEST AT K. S. POLYTECHNIC --------------------------------- LIFE AT K. S. POLYTECHNIC ------------------------- CAMPUS LIFE ----------- Our sole purpose is to provide quality and substantial technical education in aspects to serve all the needs of the students perfectly by grooming them in a most professional way. The new campus provides spacious and furnished lecture halls, seminar halls drawing halls, adequately equipped state-of-the-art laboratory facilities, a library with a whole host of books, digital library facility for enhancing knowledge of students, reading rooms, in-house canteen, playground, extra-curricular activities and so on in empowering the creative talents of students and so on which is very much suitable for the standards of National Education Policy 2020. Separate hostels are provided for boys and girls situated within walking distance from the college for convenience. The hostels are prepared to be an extended home. The hostel facilitates completely support students to carry out serious study and to grow physically, intellectually and psychology. The college tradition and discipline is also extended to the hostels. Library of K.S. Polytechnic was established with the main objective of providing best services to the users with the help of resources available in the collection. Prime attention is given for Sports to prepare the youth as dynamic individuals with a healthy sportsmanship and fitness. We encourage the potentials of our youth to shine at various levels of sports as true sports persons and good citizens. ACHIEVERS AND ACHIEVEMENTS -------------------------- Congratulations from the Management, Principal, staff, and students of KS Polytechnic on your incredible achievement in winning the contest and showcasing your project in the Engineering Fair-2024 at Visvesvaraya Industrial Technological Museum! Your dedication, hard work, and creativity have truly paid off, and We couldn't be prouder of each and every one of you. -- EXPLORE K. S. POLYTECHNIC ------------------------- VIDEO_LIBRARYCAMPUS VIDEO ------------------------- VIEW_IN_ARVIRTUAL TOUR ---------------------- PLACEMENTS AT K. S. POLYTECHNIC ------------------------------- Placement is an integral part of the education process of a student in K. S. Polytechnic. Placement preparation starts soon after admissions. At K.S. Polytechnic we have an excellent placement cell which is continuously striving to enable our students to grab the abundant worldwide job and entrepreneurial opportunities. TESTIMONIALS ------------ I am a proud alumnus of KS Polytechnic, where I completed my diploma in Electronics and Communication Engineering in 2016. My experience at KS Polytechnic not only equipped me with technical knowledge but also instilled the confidence to pursue further studies and plan a career in technology. The strong foundation laid during my time there has been instrumental in my journey, enabling me to thrive as a Technical Consultant for Cisco Cyber Security, managing partnerships across India. I am immensely grateful to KS Polytechnic for shaping my career path and setting me on a trajectory toward success. A Golden Era in My Life at K.S. Polytechnic Joining K.S. Polytechnic has been one of the best decisions of my life. During my time here, I gained extensive knowledge in Electronics and Technology, exploring various fields and branches. The faculty at K.S. Polytechnic went beyond the syllabus, providing valuable insights and taking great care in shaping my career. I would like to express my sincere gratitude to my Principal, HOD Savitha Mam, Lecturer Illahi K.N. Sir, Chidananda Sir, Bhanuprakash Sir, Ranjini Mam, Sathish Sir, Umadevi Mam, and Praveen Sir for their exceptional guidance and support throughout my journey. The best supportive faculty we received made our learning experience truly enriching. Their dedication to teaching and their willingness to guide us beyond the classroom set the foundation for our success. My self Akshay K B, 2019 batch passed out student from E&C Department currently working as a team leader at PESU ventures lab.The faculty and staff have been exceptional in every way, always going above and beyond to ensure that I",
        "have the support and resources I need to succeed in my studies. I've been impressed by the knowledge and expertise of my lecturers, who are not only highly skilled in their fields but also deeply committed to their students' success. link Important links support Student Welfare share Quick Links school Scholarship handshake Group of Institutions public Social Links KSP | Copyright © - | All Rights Reserved Designed & developed by Rapsol Technologies Pvt Ltd"
    ],
    "kssa.txt": [
        "CULTURE ------- CLIMATE ------- COST ---- LATEST NEWS ------------ Full time Diploma in Interior Design Approved by The Council Of Architecture and Affiliated to The Directorate of Technical education View more 3 Year Full time diploma Approved by The Council Of Architecture and Affiliated to the Directorate of Technical Education View more KSSA is recognized as the top 10 Colleges from Bangalore View more UPCOMING EVENTS ---------------- Venue - Seminar Hall, presented by Canadian Wood K . S . SCHOOL OF ARCHITECTURE ------------------------------ AFFILIATED TO VTU, APPROVED BY COA ----------------------------------- VISION, MISSION & CORE VALUES ----------------------------- Shall strive to build an architectural ecosystem that constantly evolves to be professionally relevant and socially sensitive. Shall empower the students to critically engage with the community and the natural environment by instilling the essential principles of design and inspiring a sense of exploration and creative experimentation in designing the built environment, with focus on Culture, Climate & Cost. Citizen : We value our role and responsibility as citizens and recognize the need to approach our profession in a humanistic manner as stewards of our built and natural environment. Passion : We value a steady and unrelenting passion and excitement for design, creativity, innovation and engagement with the issues of the built and natural environments. Agility : We value the ability to transform and innovate in response to the shifting conditions and opportunities in society. Experimentation : We value an education that embraces experimentation and risk taking that leads to innovation and discovery in order to influence the role and impact of design on society and the future. Hear from one of our Alumni Ar. Tarun B about his amazing experience at KSSA. CET CODE: E 250 COMED K CODE: E 179 ------------------------------------- QUICK LINKS ------------ SCHOLARSHIP ------------ COMMITTEES ----------- CONTACT INFO -------------"
    ],
    "kssem.txt": [
        "Larson and turbo etc. the process for recruiting student for the company was very easy, many of our friends had opened their own companies with their ability. College Events Campus was so good, where there is cultural fest every year based on the theme, and there is a chance for all to participate in any of the event of their choice. There is project exhibition every year with patent rights. Campus Life Campus infrastructure is so good that every required thing is present and it is easily available to all the students, sports is also available with the student?s choice. I got placed in Wipro - Project Engineer Infosys - System Engineer Virtusa - Java Full stack Developer Giant Eagle - Automation Testing Finding the right path to success at the right time is very important and for that way, I selected K S School of Engineering And Management. At the very outset, I would like to express my heartiest thanks to the department of E.C.E, K.S.S.E.M. In K.S.S.E.M we are trained for our placements and because of that, I was placed in one of the reputed companies. The friendly environment and the systematic approach towards imparting education at K.S.S.E.M made me a competent individual. Today, if I am in a good position it?s majorly because of what I have learned from K.S.S.E.M. The wide range of activities both curricular and co-curricular and the support from each faculty member of the E.C.E department of K.S.S.E.M was very helpful for my personal and professional growth. The faculties are very kind and approachable when any need arises. The E.C.E department professors and excellent lab facilities helped me to develop my personal and professional skills and helped me achieve great heights during my stay at K.S.S.E.M. During academic activities, the E.C.E department and especially my favorite Renuka ma'am helped me to get a lot of in-depth knowledge and understanding of cutting-edge technologies and their use in various industrial areas. It was a great experience to study here and make ourselves what we are today. I am proud to be a part of the KSSEM family. My name is Sadhana H C having USN 1KG18EC046. I'm a student of Electronics and Communication Engineering from 2018 to 2022. My experience in this college has been amazing overall, as I entered into my first year of academics all the professors were very generous in helping me understand the concepts better and made sure to clear my doubts within the class itself. Our college has great infrastructure, labs, auditoriums, and a canteen and there is also a basketball court. Everything is very hygienic and well maintained. There is IEEE Student Branch, NSS, and Rotary Club in the college which keeps all the students involved in co-curricular activities as well. I served our IEEE Student Branch as Chairperson for a year, where we conducted a lot of events which are technical and non-technical many more every month. It helped me imbibe qualities such as leadership, voluntariness, team player, communication skills and many more. There is also special placement training that is organised by the Placement department of the college for all the students. They helped us comprehend from the very basics of aptitude to how to face the interview and soft skills with various tips and tricks. I have been placed at TATA Consultancy Services as Assistant System Engineer in Web development and Project Management with CTC of 3.36 LPA. I'm grateful to my college for always encouraging, supportive and motivating us in each step to aim high and accomplish our goals. Thank you I'm Revanth A,USN 1KG18EC045 from Electronics and communication Engineering department, 8th sem. I found the institute in a very well equipped infrastructure and facilities provided to all the students, and also the faculty and all the staff in the campus are friendly and helpful in all the way. The faculty are really well trained and they support the students in all activities and provided everyone with the best teaching and made my graduation with the best learning's and development of myself. It was a great experience studying at KSSEM, a memory to cherish for lifetime. My experience at KSSEM was full of learning and grooming. I like the friendly atmosphere in our Civil Engineering department and the fact it has helped me develop a positive attitude towards my studies and discover more about myself. I am thankful to all the faculties, mentors and entire civil engineering department for providing us with quality education.They make sure every class is educational, interactive and fun. Overall it was a great experience and lifetime memory at KSSEM I Abhishek KC is an alumni of KSSEM and was a part of the first batch of this esteemed college. This college has not only transformed me into an eligible civil engineer but also has made me a successful entrepreneur, a property developer and also a modern realtor. As a student I also was exposed to all possible platforms of extra curricular to develop my talent and also helped me be a good leader. I am proud to have been a part of KSSEM forever. Abhishek KC Proprietor AB Developers, Bangalore I am fortunate to spend these wonderful two years of M. Tech at KS School of Engineering Management; it was a memorable journey of learning technical as well as life lessons. The establishment provides a welcoming atmosphere in which students feel free to communicate with professionals. Faculty members of civil department were supportive, best part is they teach concepts from basic even though we are M. Tech students, especially during pandemic online classes their efforts were a huge support. We always get a positive response when we need help regarding internship and placements; there is great exposure to research as well as extracurricular activities for M. Tech students which I love the most. I am thankful to KSSEM and Civil department for quality education and great opportunities. Hi, I am Kalyan Venkatesh B S a pass out of 2022 batch",
        "June 2022 by K. S. School of Engineering and Management for the students on \"Innovative ideas in their projects\" Project Title: \"Smart Irrigation System using IOT\" Project Students: Varun C J, Rohit Yadav, Ravi V, Abhinandan Bhagat Guide: Prof. Shashi Prasad N WINNERS OF PROJECT EXHIBITION 2021-2022 ------------------------------------------ UG Project \"Sustainability of Traditional Rural Mud House in Kanakapura Village: A Study related to Thermal Comfort\" , is been selected for the State Level Seminar & Exhibition held at Visvesvarya Technological University. Belagavi on 13th & 14th August 2022. Project Students - ANUP, SACHIN SANGAPPA KAGA, CHAITANYA K N, PRADEEP KUMAR S T Project Guide's - Mr. Naveena M P & Sushma M KSCST PROJECT SELECTED FOR STATE LEVEL SEMINAR & EXHIBITION 2021-2022 ------------------------------------------------------------------------ EXPLORE KSSEM ------------- VIDEO_LIBRARYCAMPUS VIDEO ------------------------- VIEW_IN_ARVIRTUAL TOUR ---------------------- PLACEMENTS AT KSSEM ------------------- Placement is an integral part of the education process of a student in KSSEM. Placement preparation starts soon after admissions. TESTIMONIALS ------------ It was my immense luck and fortune to be the part of KSSEM. The entire faculty and department leaves no stone unturned to shape one's future. My two year's at KSSEM have been a wonderful experience of learning with prolific exposure to outside. Huge respect, love and devotion for entire faculty members and department. Thank you for your continuous support Most humbly, my name is Kruthika B and I am a passed-out student of the 2022 batch of Computer Science and Engineering branch of K S School of Engineering and Management. I am glad to provide you with my feedback about the college. My overall experience to date has been amazing, and the college is having an amazing infrastructure and environment. The college provides excellent placement opportunities. I have been placed in 9 companies through the placement drives conducted by our college (Expleo, Valenta, Infosys, Giant Eagle, 6D Technologies, Capgemini). I have been also placed at Daimler (DTICI) with a package of 10LPA. Our college has provided me with a number of opportunities to grow and explore my skills. The emphasis on sports along with education always helped me a lot. I have always found a positive and healthy environment and the teachers are highly supportive and friendly. Most of my doubts were cleared after the classes were over. I am highly thankful to you for providing me with an opportunity to be a part of our college. It has added a number of values to my life. My experience in college has been one of the richest experiences of my professional life. This college has given me hope about what higher education can do, it encourages individuality and conductivity. Kssem has one of the best labs, facilities, library, campus, faculty, staffs and canteen. The college library has variety of books on different domains and is easy to access with the help of staff who are more than ready to help. The faculty are very welcoming and friendly going with students. The last fest Aarohana was from 20th to 24th of june 2022 which is the best experience I had in this college. Personally to me memories of Aarohana is the best of all where I enjoyed the most after academics. I would say experiences i had in kssem is one of the best and will always be memorable. Hello everyone, I am Sushil Singh a passed out of 2022 batch of CSE department from K S School of Engineering and Management and currently placed in my dream company which is Quest Global , hence I am thankful to each one of them in my learning journey. The infrastructure of the college is amazing and we got positive learning environment to procure profound knowledge right from basics to advanced skills in all fields. We also got clarity to choose exact courses for the domain as per our interest. Also, with the college being in a silent place, the college also has a basketball court, Library ,Xerox Shop and Canteen and various other student friendly areas. We also have annual sports and cultural activities to promote good culture among the students. Even, the placement cell of the college helps every student to get placed, placement training which starts from 1st year of the course itself with extra-ordinary placement training. The college also promotes anti-ragging and no-tobacco use in the college premises. Along with that the college has helped me to step out of my comfort zone and work in any given environment. I am exceptionally thankful to all college professors and also to entire college management team for providing this extremely positive learning environment throughout my academic journey. My Two years at KSSEM were great and memory to cherish for a lifetime. It was full of learning and grooming oneself. It gave me an opportunity to explore things which Excel my knowledge. I am thankful to all the faculties, mentors as well as placement cell. Overall it was a great experience and lifetime memory at KSSEM Hello Everyone I am Haritha. Coming to my Journey at KSSEM I have done Electronics & Communication Engineering at KSSEM. The institute provides great facilities to its students along with the best quality education and on campus placements opportunities. Course was very good that it enriched my knowledge content through various fields with practical as well as theory, faculties are very good. Internships Opportunities Yes I opted for internship, I did my internship at Tequed labs On Technologies like Artificial Intelligence and Machine Learning at Ittamadu main Road, Banashankari. I got Paid Internship from the College at Giant Eagle located at Thanisandra, Yelahanka and Explored many technologies like Automation Testing using selenium with Python. I got stipend of 23000/-, overall process of an internship was good. Placement Experience The placement training starts from the 3rd year and students will be permitted to take the placement tests from the 7th semester. Highest package is about 10 lakhs and I got placed in Companies like Infosys, Wipro and Virtusa. Many companies visit our college like Infosys, Tata consultancy service,",
        "College code CET : E203 COMED-K : E067 PG-CET MTech : T909 PG-CET MBA : B198 Notification | Kammavari Sangham (R) 1952, K. S. Group of Institutions K. S. SCHOOL OF ENGINEERING AND MANAGEMENT No.15, Mallasandra, Off. Kanakapura Road, Bengaluru-560109, +919900710055 Affiliated to VTU, Belagavi & Approved by AICTE, New Delhi, Accredited by NAAC WELCOME TO KSSEM ---------------- The Kammavari Sangham, a multi-activity non-profit oriented voluntary service organization, was established in the year 1952 with the sole objective of providing charitable service to community and society. The Sangham has diversified its activities since its establishment over five decades ago. With a firm belief that quality and meaningful education only can lay the strong foundation for bringing about economic and social changes to the lives of thousand, the Sangham went about establishing educational institutions, starting with K.S. Polytechnic in 1992. Enthused with this success of its foray into technical education, the Sangham moved forward by starting the K.S School of Engineering and Management (KSSEM) in the year 2010. The campus of K S School of Engineering and Management, nestled in a quiet location off the Kanakapura Main Road, provides good facilities that are required for quality technical education. KSSEM's strength lies in its good vision; dedicated, experienced and well qualified teaching staff; the establishment with recent equipment in the laboratories and the interactive relationship that it has forged with the industry; all with the active support of an eminent Management. KSSEM is offering six Under Graduate courses namely Civil Engineering, Computer Science and Engineering, Electronics and Communication Engineering, Artificial Intelligence and Data Science, Computer Science & Business System and Mechanical Engineering. It is also offering M Tech course in Structural Engineering and Masters in Business Administration. SCHOOLVISION ------------ WORKSPACE_PREMIUMMISSION ------------------------ K. S. SCHOOL OF ENGINEERING AND MANAGEMENT SHALL, ------------------------------------------------- PROGRAMMES AT KSSEM ------------------- Department of Artificial Intelligence & Data Science Department of Civil Engineering Department of Computer Science & Business System Department of Computer Science & Engineering Department of Electronics & Communication Engineering Department of Mechanical Engineering Department of Applied Science Master of Technology in Structural Engineering Master of Business Administration National Service Scheme (NSS) Department of Training & Placements K S Research & Innovation Foundation (KSRIF) ARTIFICIAL INTELLIGENCE & DATA SCIENCE -------------------------------------- At AI & DS, we equip students with the skills to harness artificial intelligence and data science to solve real-world challenges and drive innovation. LATEST AT KSSEM ----------------- LIFE AT KSSEM ------------- CAMPUS LIFE ----------- Kammavari Sangham School of Engineering and Management is not just a college. It's a community of pro-active students with ambitious dreams. A dream of a bright future. A dream of a successful life. KSSEM has always stood for discipline and in molding character of its students. The institute prides itself in imparting value added education by laying a strong foundation for the holistic growth of student community. Separate hostels are provided for boys and girls situated within walking distance from the college for convenience. The hostels are prepared to be an extended home. The hostel facilitates completely support students to carry out serious study and to grow physically, intellectually and psychology. The college tradition and discipline is also extended to the hostels. Library of K.S. School of Engineering and Management was established in the year 2010 with the main objective of providing best services to the users with the help of resources available in the collection. Sport includes all forms of competitive physical activity or games which, through casual or organized participation, at least in part aim to use, maintain or improve physical ability and skills while providing enjoyment to participants, and in some cases, entertainment for spectators. ACHIEVERS AND ACHIEVEMENTS -------------------------- B NAYANA , 6th semester , 1KG21CS014, Department of CSE Secured Bronze Medal in 400Mts free style .The VTU, State level Swimming Competition Organized by RVITM, Bangalore at Basavanagudi Aquatic center on 19th & 20th June 2024 BRONZE MEDAL --------------- Secured 5 bronze medal 100M Free Style, 200M Free Style,400M Free Style 800M Free Style & 200M IM in the VTU State Level swimming competition 2023 held at MSRIT Bangalore 9th August 2023. BRONZE MEDAL --------------- Congratulations Pradeep A of Mechanical Department (1KG19ME016) for Securing 8th Rank in VTU 2022-23 VTU 8TH RANK FOR PRADEEP . A ------------------------------- Project Exhibition 2022-2023 was organized on 08/05/23 by K. S. School of Engineering and Management for the students PROJECT EXHIBITION WINNERS 2022-2023 --------------------------------------- Project Exhibition 2022-2023 was organized on 08/05/23 by K. S. School of Engineering and Management for the students PROJECT EXHIBITION RUNNERS 2022-2023 --------------------------------------- Overall Championship is won by CSE Department in Annual Sport Meet organized by KSSEM on 25/03/2023 ANNUAL SPORTS MEET WINNER ---------------------------- Overall Championship is won by CSE Department in Annual Sport Meet organized by KSSEM on 11/06/2022 ANNUAL SPORTS MEET WINNER ---------------------------- Project Exhibition 2021-2022 was organized on 21/06/22 by K. S. School of Engineering and Management for the students PROJECT EXHIBITION RUNNERS 2021 - 2022 ----------------------------------------- Project Exhibition 2021-2022 was organized on 21/06/22 by K. S. School of Engineering and Management for the students on innovative ideas. PROJECT EXHIBITION WINNERS 2021-2022 --------------------------------------- Mr. Tarun Kumar V, Alumni of Department of Civil Engineering, KSSEM as been awarded \"Outstanding performance as Field Surveyor - 2021-2022\" from \"Black Olive Ventures Pvt. LTD. OUTSTANDING PERFORMANCE AS FIELD SURVEYOR 2021-2022 ------------------------------------------------------ Mr. Nikhil C, Alumni of Department of Civil Engineering, KSSEM has been awarded for \"Outstanding Performance for the Financial Year 2021-2022 from \"Black Olive Ventures Pvt. LTD.\" OUTSTANDING PERFORMANCE FOR THE FINANCIAL YEAR 2021-2022 ----------------------------------------------------------- Project Exhibition for U G Final Year Students was organized on 21st of June 2022 by K. S. School of Engineering and Management for the students on \"Innovative ideas in their projects\" Project Title: \" \"Transit Oriented Development - A Case Study of Namma Bengaluru Metro Phase 1\" Project Students: Bhargava M, Rohit K S, Ganesh S, Muniratanam B S Guide: Prof. Sai Sushma B A RUNNERS OF PROJECT EXHIBITION 2021-2022 ------------------------------------------ Project Exhibition for U G Final Year Students was organized on 21st of",
        "from KSSEM and currently placed in Mpokket and NTT Data Services. Firstly the infrastructure of the college is really good with the college being in a silent place, the college also has a basketball court, Xerox Shop and Canteen. Along with this there are annual sports and cultural activities to promote good culture among the students. The placement cell of the college helps every student to get placed, this starts from 1st year of the course itself. The college also promotes anti-ragging and no-tobacco use in the college premises. Along with that the college has helped me to step out of my comfort zone and work in any given environment. If you want to find the secrets of the universe, think in terms of energy, frequency, and vibration as quoted by ' Nicola Tesla', was proven right by the teachers of KSSEM. Firstly I would like to thank the editorial team for giving me this opportunity. When I first stepped into KSSEM College I never expected my life to take such a wonderful phase! Initially, when I was in my first year, I thought my engineering life would be study oriented, but as I entered the COMPUTER SCIENCE branch it all changed!! Teachers were so experienced and knowledgeable that they not only helped me to excel in academics but in building my character. They were very much supportive in all ways. Apart from classroom studies, KSSEM highly encourages students to take up extracurricular activities; the most memorable will be the college fest AAROHANA 2022. I am grateful to have had such an opportunity; this helped me immensely gain knowledge and also made me a betterment engineer. I would like to thank every member of our department and Management for their support and encouragement. Hello, I am Amitha S M a passed out of 2022 batch from KSSEM and currently placed in Giant Eagle and NTT Data Services. Firstly the infrastructure of the college is really good and located in a peaceful environment. The college provides the laboratories with the required open source software and internet facilities. The faculties of the college are very supportive and encourage students to develop their skills. The college also has a basketball court, Xerox Shop and Canteen. Along with this there are annual sports and cultural activities to promote good culture among the students. The placement cell of the college helps every student to get placed, this starts from 1st year of the course itself by providing technical and soft skill training. The college also promotes anti-ragging and tobacco free in the premises. The college has helped me to develop my skills and work in any given environment. Going into college, my only goal was to graduate with an engineering degree. But, looking back on the last four years, KSSEM has played an integral part in my development as a capable software engineer. The university has constantly provided me with good opportunities and resources to improve myself. The faculty at Computer Science Engineering is second to none. They are proficient, accessible, and patient. My bachelor's degree at KSSEM majoring in Software Technology has been eye-opening. The placement team here works hard to bring in several core and big companies; there are placement drives happening almost every day. The workshops and hackathons conducted by the various teams here at the institution helped me get a good overview of what is needed to work in a collaborative and professional environment. I am very grateful to them for assisting me in obtaining an internship at Celstream Technologies as an Interim Engineering Intern. If you want to find the secrets of the universe, think in terms of energy, frequency and vibration. as quoted by ' Nicola Tesla', was proven right by the teachers of KSSEM. Firstly I would like to thank editorial team for giving me this opportunity. When I first stepped into KSSEM college I never expected my life to take such a wonderful phase! Initially, when I was in first year, i thought my engineering life would be study oriented, but as I entered COMPUTER SCIENCE branch it all changed !! Teachers were so experienced and knowledgeable that they not only helped me to excel in academics but in building my character.They were very much supportive in all ways. Apart from classroom studies,KSSEM highly encourages students to take up extra - curricular activities, the most memorable will be the college fest AAROHANA 2022. I am greatful to have such an opportunity, this helped me immensely gain knowledge and also made me a betterment engineer. I would like to thank each and every member of our department and Management for their support and encouragement. link Important links support Student Welfare share Quick Links school Scholarship handshake Group of Institutions public Social Links KSSEM | Copyright © | All Rights Reserved Designed & developed by Rapsol Technologies Pvt Ltd"
    ],
    "principal.txt": [
        "1. Principal – K.S. School of Engineering and Management (KSSEM): Name: Dr. K. Rama Narasimha Position: Principal & Director, K.S. School of Engineering and Management Qualifications: Not publicly available Profile: Dr. K. Rama Narasimha is the Principal and Director of KSSEM. The institution has been shaping and molding professional engineers who serve society in various capacities. Under his leadership, KSSEM continues to focus on academic excellence, research, and holistic student development. Here are the Heads of Departments (HODs) at K.S. School of Engineering and Management (KSSEM): 1. Department of Mechanical Engineering Head: Dr. B. Balaji Qualifications: M.Tech., MISTE., MIE., Ph.D. Profile: Dr. Balaji has been leading the Mechanical Engineering Department since its inception in 2010. Under his guidance, the department offers both undergraduate and postgraduate programs, emphasizing research and practical application in areas like Thermal, Design, Manufacturing, and Management. 2. Department of Civil Engineering Head: Dr. Vijayalakshmi Akella Qualifications: Ph.D. Profile: Dr. Akella has been with the Civil Engineering Department since its establishment in 2010. The department offers undergraduate and postgraduate programs, focusing on Structural Engineering. Dr. Akella emphasizes high-quality teaching, research, and consultancy, aiming to produce competent civil engineers. 3. Department of Electrical and Electronics Engineering Head: Dr. Arun Kumar M Qualifications: M.Tech., Ph.D. Profile: Dr. Arun Kumar has been leading the department since its inception in 2010. The department focuses on providing a strong foundation in electrical and electronics engineering, encouraging students to engage in research and stay updated with industry trends. 4. Department of Computer Science and Engineering (CSE) Head: Dr. Kothapalli Venkata Rao Qualifications: M.Tech., Ph.D. Profile: Dr. Rao has over 25 years of experience in academia. His research interests include healthcare analytics, machine learning techniques, and data science. He has contributed to the field with multiple patents and numerous publications in reputable journals. Dr. Rao was also recognized with the Young Scientist Seed Money Award from the Vision Group of Science and Technology (VGST), Government of Karnataka in the academic year 2016-17. Contact: hod.cse@kssem.edu.in | +91 9343751362 5. Department of Computer Science and Business Systems Head: Prof. Ramesh Babu Qualifications: Associate Professor Profile: Established in 2022, the department aims to produce industry-ready professionals proficient in both computer science and business systems. Prof. Ramesh Babu emphasizes a curriculum that includes emerging topics like Analytics, Machine Learning, and Cloud Computing. 6. Department of Management Studies (MBA) Head: Prof. Manjunatha S Qualifications: B.Sc., MBA (Ph.D.) Profile: Prof. Manjunatha leads the MBA department, focusing on providing a comprehensive business education that combines theoretical knowledge with practical application. The department organizes various seminars and workshops to enhance students' managerial skills. 7. Department of Applied Science Head: Dr. Swarna S Position: Head, Department of Chemistry Profile: The Applied Science department, comprising Mathematics, Physics, Chemistry, Biology, and Humanities, has been integral to KSSEM since 2010. Dr. Swarna S leads the Chemistry division, aiming to equip students with essential knowledge and practical skills for their engineering education. 8. Library Head: Dr. Ambika C A Qualifications: B.A., MLISc., M.Phil, KSET, Ph.D. Profile: As the librarian, Dr. Ambika oversees the institution's knowledge center, established in 2010. The library supports teaching, learning, and research activities, providing a vast collection of resources for students and faculty. 1. Principal – K.S. School of Architecture (KSSA) Name: Ar. Thrivikram N. B. Position: Principal, K.S. School of Architecture Qualifications: Not publicly available Profile: Ar. Thrivikram N. B. is the Principal of K.S. School of Architecture (KSSA). The institution, which was established in 2015, is part of the K.S. Group of Institutions and aims to provide quality education in architecture and design. Ar. Thrivikram is responsible for leading the academic and administrative functions of the institution, ensuring the development of the students in architectural studies. 2. Head of Department (HOD) – Bachelor of Architecture (B.Arch) Name: Not publicly available Position: Head of the Department (HOD), B.Arch Qualifications: Not publicly available Profile: The official details regarding the HOD of the B.Arch department at KSSA are currently not available on the institution’s website or other sources. 1. Principal – K.S. Polytechnic (KSP) Name: Prof. Suresh Position: Principal, K.S. Polytechnic Qualifications: Not publicly available Profile: Prof. Suresh is the Principal of K.S. Polytechnic (KSP), an institution that has been providing quality technical education for over 30 years under the Kammavari Sangham (R). The institution is committed to holistic education, focusing on the overall development of its students through a dedicated team of faculty and modern facilities. 2. Heads of Departments (HODs) – K.S. Polytechnic (KSP) Department of Electronics and Communication Engineering Head: Mrs. Savitha M. Qualifications: B.E., M.Tech. Profile: Mrs. Savitha M. leads the Electronics and Communication Engineering department, ensuring students gain quality education and practical exposure. The department conducts seminars, guest lectures, and industry visits to bridge the gap between academic curriculum and industry requirements. Department of Computer Science and Engineering Head: Mrs. Prathima Raju Qualifications: B.E., M.Tech. Profile:With 25 years of experience, Mrs. Prathima Raju is an alumna of Sri Jayachamarajendra College of Engineering, Mysore. She emphasizes industry-oriented learning, ensuring students participate in seminars, workshops, and guest lectures to enhance their technical and practical knowledge. Department of Civil Engineering Head: Mr. D. K. Jagadeesh Qualifications: B.E., MISTE Profile:Mr. D. K. Jagadeesh has been leading the Civil Engineering department since its inception in 2004. The department is equipped with modern laboratories and classrooms, offering quality teaching and hands-on experience to produce competent civil engineers. Department of Mechanical Engineering Head: Not Specified Qualifications: B.E. (I&P), M.E. (M.E.), M.Tech. (PDM), MIE, MISTE, MIWS Profile:The Mechanical Engineering department, established in 1994, provides well-furnished laboratories and modern classrooms. The department frequently organizes seminars, guest lectures, and industry visits to keep students updated with the latest industry trends. Department of Automobile Engineering Head: Mr. Ravindra B. S. Qualifications: B.E. Profile:With 30 years of experience (including 20 years at KSP), Mr. Ravindra B. S. is an alumnus of MCE, Hassan (affiliated with VTU, Belagavi). He leads the Automobile Engineering department, emphasizing practical learning and industry collaboration."
    ],
    "teachers.txt": [
        "Sl. No.,Name,PAN,Designation,Year of Appointment,Nature of Appointment,Department 1,Dr Vijayalakshmi Akella,AETPA6013Q,Professor & Head,2011,Permanent,CV 2,Dr.Arekal Vijay,AIUPV3609Professor,2011,Permanent,CV 3,M Veerendra Kumar,AAXPV7682E,Associate Professor,2012,Permanent,CV 4,Dr Vyshali,AGPPV9333A,Associate Professor,2012,Permanent,CV 5,Sushma M,GFPPS3116K,Assistant Professor,2015,Permanent,CV 6,Naveena M P,BQJPP1667C,Assistant Professor,2017,Permanent,CV 7,Manjunath B,CNUPM0337B,Assistant Professor,2017,Permanent,CV 8,Prashanth M,CGRPM3136N,Assistant Professor,2017,Permanent,CV 9,Sasha Rai P,BNGPR0622H,Assistant Professor,2018,Permanent,CV 10,Shashi Prasad N,FCNPS5332B,Assistant Professor,2018,Permanent,CV 11,Amrutha Dhiraj,AQDPA6718J,Assistant Professor,2019,Permanent,CV 12,Veena R,BUNPV77830,Assistant Professor,2020,Permanent,CV 13,Dr.Vandana Jha,AGJPJ4973E,Professor & Head,2018,Permanent,CS 14,Mr.Santosh Kumar J,AMEPJ2291G,Associate Professor,2013,Permanent,CS 15,Mr.Sandeep H,CPBPS8015R,Associate Professor,2012,Permanent,CS 16,Mrs.Deepa Yogish,AENPY2398L,Assistant Professor,2018,Permanent,CS 17,Mr. Pradeep K R,BDDPP8645R,Assistant Professor,2019,Permanent,CS 18,Mr.Santhosh Kumar S,EBPPS5545L,Assistant Professor,2013,Permanent,CS 19,Mr.Deepak M. D,BFGPD7649L,Assistant Professor,2011,Permanent,CS 20,Mr.Ugrananda Channabasava,ASKPC2547A,Assistant Professor,2012,Permanent,CS 21,Mrs.Sandhya.A. Kulkarni,BYWPK3365F,Assistant Professor,2013,Permanent,CS 22,Mrs.Amitha S,CCTPS9272F,Assistant Professor,2013,Permanent,CS 23,Mr.Ashoka S,ALQPA0575K,Assistant Professor,2014,Permanent,CS 24,Mrs.Megha J,BCWPM7834B,Assistant Professor,2015,Permanent,CS 25,Mrs.Gargi N,BRZPG6990A,Assistant Professor,2015,Permanent,CS 26,Mrs.R.S.Geethanjali,BDBPG4866P,Assistant Professor,2017,Permanent,CS 27,Mrs.K V Shalini,DJSPS9201P,Assistant Professor,2019,Permanent,CS 28,Mrs.Swathi Darla,ASYPD0914G,Assistant Professor,2017,Permanent,CS 29,Mrs. Swetha P,CSTPS6855C,Assistant Professor,2020,Permanent,CS 30,Mrs. Rashmi B H,BLIPR896B,Assistant Professor,2021,Permanent,CS 31,Dr.Girish V.Attimarad,AEOPA8923N,Professor & Head,2016,Permanent,EC 32,Dr.Karthik P,ATVPP5505B,Professor,2013,Permanent,EC 33,Dr.Dushyantha N D,AIPPD6738F,Professor,2017,Permanent,EC 34,Dr. K. Senthil Babu,BMRPS1349N,Professor,2019,Permanent,EC 35,Mr.Sanjay Baburao Nayak,AASPN0632P,Associate Professor,2013,Permanent,EC 36,Mr.Manu D K,AMJPD0996K,Associate Professor,2011,Permanent,EC 37,Sasindran Madhava Prabhu,AARPM8764C,Associate Professor,2019,Permanent,EC 38,Mr.Gopalkrishnamurthy C R,AJXPG8705E,Assistant Professor,2011,Permanent,EC 39,Mrs.Shanthala G M,BJXPS3554A,Assistant Professor,2012,Permanent,EC 40,Mr.Ravikiran Ananthasubbaraya,BADPR6478R,Assistant Professor,2011,Permanent,EC 41,Ms.Shalini Shravan,AGCPJ6833A,Assistant Professor,2012,Permanent,EC 42,Ms.Renuka V Tali,BHRPR0424E,Assistant Professor,2013,Permanent,EC 43,Mr.Puneeth S,BGSPP4875M,Assistant Professor,2013,Permanent,EC 44,Ms.Gunasheela T.J,AOYPG1166P,Assistant Professor,2013,Permanent,EC 45,Mr.Vinay R,AUHPR9454N,Assistant Professor,2013,Permanent,EC 46,Mr.Syed waseem Tabraiz,AMTPT7196B,Assistant Professor,2014,Permanent,EC 47,Ms.Shilpa A.P,FQHPS8946H,Assistant Professor,2017,Permanent,EC 48,Dr.Kishore M,AQGPM7368B,Assistant Professor,2019,Permanent,EC 49,Ms. Vinutha Srikanth,ADYPV8279P,Associate Professor & Head,2019,Permanent,EE 50,Mr. Arun Kumar M,AHJPA3133G,Associate Professor,2018,Permanent,EC 51,Ms. Ramya.K.R,CCMPK8344M,Associate Professor,2011,Permanent,EE 52,Ms. Manjula.B.G,APZPB4487N,Associate Professor,2012,Permanent,EE 53,Ms. Hema Priya M,AMVPR7942R,Assistant Professor,2019,Permanent,EE 54,Ms. Shruti V Joshi,AKGPJ5538G,Assistant Professor,2018,Permanent,EE 55,Ms.Tejaswini G V,AGHPV2515J,Assistant Professor,2018,Permanent,EE 56,Ms. Prathiksha,CSMPP0043E,Assistant Professor,2019,Permanent,EE 57,Dr. K Ramanarasimha,AECPR6639G,Principal/Director,2019,Permanent,ME 58,Dr. Balaji B,AJRPB4121B,Professor & Head,2019,Permanent,ME 59,Dr.Jyothi P.N,AKZPP0149C,Professor,2010,Permanent,ME 60,Mr. Nagraj M S,AAZPN1391G,Associate Professor,2019,Permanent,ME 61,Mr. Abhishek M R,ANKPA3538N,Associate Professor,2019,Permanent,ME 62,Mr. Harsha J,AIXPH1349A,Assistant Professor,2014,Permanent,ME 63 Mr. Prashanth J ALAPJ9137C Assistant Professor 2013 Permanent ME 64 Mr. Akashdeep B N AUYPB8443N Assistant Professor 2013 Permanent ME 65 Mr. Santosh Kumar K J DRHPS4884R Assistant Professor 2013 Permanent ME 66 Mr. Vijay Chandan AIGPV2856D Assistant Professor 2018 Permanent ME 67 Mr. Vinod A AKHPV0485H Assistant Professor 2014 Permanent ME 68 Mr. Prabhu K S BTDPP9938D Assistant Professor 2018 Permanent ME 69 Mr. Nishanth Nag CEBPD2249K Assistant Professor 2018 Permanent ME 70 Dr. Gopal BMGPV273N Professor & Head 2021 Permanent MBA 71 Roopa Balavenu AL1PB6455F Assistant Professor 2020 Permanent MBA 72 Sreedhar. N BNQPS0973J Assistant Professor 2020 Permanent MBA 73 Pradeep BNVPP8684C Assistant Professor 2013 Permanent MBA 74 V. Vidya Shree BMGPV273N Assistant Professor 2020 Permanent MBA 75 Dr.C.Vasudev AFJPV1695J Professor & Head 2013 Permanent BS & H 76 Dr. Remya P Narayan EEPPP4402G Assistant Professor 2020 Permanent BS & H 77 Mrs.Vinutha S.V AMWPV3887G Assistant Professor 2011 Permanent BS & H 78 Mr.Manoharkumar K.N. BIAPM8111R Assistant Professor 2015 Permanent BS & H 79 Mrs. Nagarathna T.K. ATMPN0939L Assistant Professor 2016 Permanent BS & H 80 Ms.Divya R BDBPD1309N Assistant Professor 2017 Permanent BS & H 81 Mrs.Swarna S CIPPS1078F Assistant Professor 2011 Permanent BS & H 82 Ms.Kusuma M DHQPK5346K Assistant Professor 2012 Permanent BS & H 83 Mrs. Pavithra J BMRPP2502A Assistant Professor 2015 Permanent BS & H"
    ],
    "timings_reslut.txt": [
        "1.The official working hours for K.S. School of Engineering and Management (KSSEM) are not explicitly stated in the available sources. However, the library operates from Monday to Saturday, 8:40 a.m. to 4:00 p.m., extending to 5:00 p.m. during regular exams. Additionally, an AI & ML offline training program was scheduled from 9:00 a.m. to 4:00 p.m. These timings suggest that the college's operational hours likely align with a typical academic schedule, starting in the morning and concluding in the late afternoon. 2.The lunch hours at K.S. School of Engineering and Management (KSSEM) are from 12:35 PM to 1:20 PM. 3.The canteen at K.S. School of Engineering and Management (KSSEM) offers a diverse menu catering to various culinary preferences. While specific dishes are not listed in the available sources, the canteen provides a wide variety of food options, ranging from Chinese to South Indian cuisines. The facility emphasizes cleanliness and hygiene, ensuring that all meals are prepared in a well-maintained and advanced kitchen. Additionally, there are separate dining areas for students and faculty, accommodating up to 100 individuals. The canteen operates from 8:00 a.m. to 3:40 p.m., aligning with the college's schedule. 4.KSSEM College Timings: College Hours: 8:30 AM – 3:40 PM Lunch Break: 12:35 PM – 1:20 PM Canteen Hours: 8:00 AM – 3:40 PM Library Hours: 8:30 AM – 5:00 PM (May vary) Office Hours: 9:00 AM – 4:00 PM vtu result link:- Steps to Check Your VTU Results: Visit the Official VTU Results Portal: Navigate to https://results.vtu.ac.in.​ Select Your Examination Type: Choose the relevant exam type (e.g., BE/B.Tech, MBA, MCA) from the options provided.​ Enter Your University Seat Number (USN): Input your unique USN in the designated field.​ Submit and View Results: Click on the \"Submit\" button to view your results."
    ]
}